import os

from dotenv import load_dotenv
from langchain_core.prompts import PromptTemplate
from langchain_openai import ChatOpenAI
from langchain_ollama import ChatOllama

load_dotenv()


def main():
    
    
    info = """
        السلطان هيثم بن طارق بن تيمور آل سعيد (11 أكتوبر 1955)، سلطان سلطنة عمان ورئيس مجلس الوزراء منذ 11 يناير 2020 والسلطان الرابع عشر لعمان من سلالة المؤسس الأول للدولة البوسعيدية الإمام أحمد بن سعيد البوسعيدي. تولى الحكم خلفًا لابن عمه السلطان قابوس بن سعيد وطبقًا لوصيته، وتمت البيعة له في العاشر من يناير 2020 بالقصر السلطاني.

        ولد السلطان هيثم بن طارق في مسقط لوالده طارق بن تيمور الذي شغل منصب رئيس مجلس وزراء سلطنة عمان (1970-1972) في عهد السلطان الراحل قابوس بن سعيد، تلقى هيثم بن طارق تعليمه الابتدائي في المدرسة السعيدية بمسقط، بينما أكملهُ في المملكة المتحدة لمواصلة دراسته الثانوية والجامعية في جامعة أكسفورد، تخرج عام 1979م من برنامج جامعة أكسفورد للخدمات الخارجية ثم تابع دراساته العليا في كلية بيمبروك في أكسفورد.

        يعود نسب السلطان هيثم إلى آل بو سعيد، وهي العائلة الحاكمة في سلطنة عمان التي تأسست على يد أحمد بن سعيد البوسعيدي (1744-1783) الملقب بالمتوكل على الله مؤسس الدولة البوسعيدية في عمان وكانت تحكم سابقا زنجبار. شغل السلطان هيثم منصب وزير التراث والثقافة منذ فبراير 2002، وكان رئيس اللجنة الرئيسية للرؤية المستقبلية «عمان 2040» كما شغل العديد من المناصب في وزارة الخارجية منها الأمين العام، ووكيل الوزارة للشؤون السياسية ووزير مفوض، وعمل في بعض الأحيان مبعوثاً خاصاً للسلطان قابوس بن سعيد.

        في 10 يناير عام 2020، توفي السلطان قابوس بن سعيد الذي حكم السلطنة لمدة 50 عام تقريبًا منذ السبعينات وكان صاحب أطول فترة حكم من بين الحكام العرب والثالث في العالم، اجتمع مجلس الدفاع في سلطنة عمان ودعا مجلس العائلة الحاكمة للإنعقاد لتحديد من تنتقل إليه ولاية الحكم، وبعد أن انقضت ثلاثة أيام ولم يتم فيها اختيار سلطان للبلاد، أوكل مجلس العائلة المالكة لمجلس الدفاع القيام بفتح وصية السلطان قابوس بن سعيد، ونصت الوصية التي قرأت على الهواء مباشرة على تسميه (هيثم بن طارق آل سعيد) سلطاناً لعُمان، أدى السلطان هيثم اليمين الدستورية وألقى خطاب التنصيب في ذات اليوم ليكون السلطان الرابع عشر لسلطنة عمان من أسرة آل بوسعيد، وليتولى مهامه بشكل رسمي في انتقال سلس للحكم في السلطنة كان موضع تقدير العالم وإعجابه.

        ومنذ اليوم الأول لتولي السلطان هيثم بن طارق مقاليد الحكم، وضع الخطوط العريضة التي حدد فيها ملامح سياسته الداخلية والخارجية، فقد أكد في خطابه الأول أنه ماضٍ في الحفاظ على ما أنجزه سلطان البلد الراحل قابوس بن سعيد والبناء عليه للحفاظ على المنجزات التي حققتها النهضة العمانية خلال العقود الخمسة الماضية، كما أكد أنه سيرتسم خطى السلطان الراحل في السياسة الخارجية مؤكدا على الثوابت التي اختطها لسياسة السلطنة الخارجية القائمة على التعايش السلمي بين الأمم والشعوب وحسن الجوار وعدم التدخل في الشؤون الداخلية للغير واحترام سيادة الدول.

        كما شدد السلطان هيثم في خطابه على أهمية بناء وتطوير القدرات البشرية، وخاصة فئتي الشباب والنساء، والعمل على قضايا التشغيل وتقليص معدلات البطالة ورفع معدلات الأجور وكل ما من شأنه تعزيز الحقوق الاجتماعية والاقتصادية، وعلى قضايا حقوق المرأة العُمانية، معتبراً إياها شريكة أساسية في صناعة القرار، وعلى ضرورة تطوير وتنمية قطاع التعليم وتوجيه موارد السلطنة المالية بما يضمن خفض المديونية وزيادة الدخل، والتوجه نحو سياسات التنويع الاقتصادي وتعزيز التوزان المالي والاهتمام بالمشاريع التي تستند إلى الابتكار والذكاء الاصطناعي والتقنيات المتقدمة بما يسرّع الوصول إلى اقتصاد وطني معرفي ومستدام.

        تزوج السلطان هيثم بالسيدة عهد بنت عبد الله البوسعيدية وأنجب منها أربعة أبناء: ذي يزن بن هيثم، بلعرب بن هيثم، ثريا بنت هيثم، وأميمة بنت هيثم. يذكر أنه من محبي رياضة كرة القدم ولذلك تولّى رئاسة الاتحاد العماني لكرة القدم في الثمانينات وترأس اللجنة المنظمة لدورة الألعاب الآسيوية الشاطئية الثانية التي أقيمت في مسقط 2010. حاز السلطان هيثم على العديد من الأوسمة خلال مسيرته العملية أبرزها وسام الرسوخ الذي تسلمه من السلطان قابوس بن سعيد، ووسام الشرف الكبير للخدمات المقدمة من جمهورية النمسا، ووشاح الملك عبد العزيز من الطبقة الأولى، ووسام الفارس الفخري الكبير للصليب الملكي الفيكتوري من المملكة المتحدة، كما منحته أكاديمية طشقند للعلوم والدراسات الإسلامية في أوزبكستان شهادة الدكتوراه الفخرية تقديرًا لدعمه حركة الثقافة والمثقفين عام 2018
    """

    summary_temp = """
        given the information {info} about a person I want you to create:
        1. A short summary
        2. two interesting facts about the person
    """

    prompt = PromptTemplate(input_variables=["info"], template=summary_temp)
    # llm = ChatOpenAI(model="gpt-3.5-turbo", temperature=0.9) 
    llm = ChatOllama(temperature=0.9, model="gemma3:270m")
    chain = prompt | llm
    res = chain.invoke(input={"info": info})
    print(res)

if __name__ == "__main__":
    main()
